app/Controllers/Dashboard/Blog.php

SELECT *
FROM `blogs`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `blogs`
---
    public function index()
    {
            $data = [
            'title'      => 'Manajemen Blog',
            'breadcrumb' => [
                ['label' => 'Dashboard', 'url' => base_url('dashboard')],
                ['label' => 'Blog']
            ],
            'blogs' => $this->blogModel->paginate(10, 'blogs'),