app/Controllers/Dashboard/Developer.php

   public function index()
    {
        $developerModel = new \App\Models\DeveloperModel();
        $propertyModel  = new \App\Models\PropertyModel();

        // Ambil daftar developer dengan pagination
        $devs = $developerModel->orderBy('name', 'ASC')->paginate(5, 'developers');

        // Untuk setiap developer, ambil properti mereka beserta detail-nya
        foreach ($devs as &$d) {
            $d['properties'] = $propertyModel
                ->select('properties.id, properties.title, property_details.location, property_details.price_text')
                ->join('property_details', 'property_details.property_id = properties.id', 'left')
                ->where('properties.developer_id', $d['id'])
                ->findAll();
---
SELECT *
FROM `developers`
ORDER BY `name` ASC
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `developers`
SELECT `properties`.`id`, `properties`.`title`, `property_details`.`location`, `property_details`.`price_text`
FROM `properties`
LEFT JOIN `property_details` ON `property_details`.`property_id` = `properties`.`id`
WHERE `properties`.`developer_id` = '8'