app/Controllers/Dashboard/Index.php

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
SELECT SUM(`total`) AS `total`
FROM `penjualan`
 LIMIT 1
SELECT *
FROM `developers`
SELECT `properties`.*, `developers`.`name` as `developer_name`, `property_details`.`price_text`, `property_details`.`description`
FROM `properties`
LEFT JOIN `developers` ON `developers`.`id` = `properties`.`developer_id`
LEFT JOIN `property_details` ON `property_details`.`property_id` = `properties`.`id`
 LIMIT 4
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil user lengkap dari database
        $user = $this->userModel->find(session('id'));

        // Cek field yang wajib diisi
        $profileIncomplete =
            trim($user['place_of_birth'] ?? '') === '' ||
            trim($user['date_of_birth'] ?? '') === '' ||
            trim($user['gender'] ?? '') === '' ||
            trim($user['address'] ?? '') === '';

        // Hitung total penjualan
        $jumlahPenjualan = (int) ($this->penjualanModel->selectSum('total')->first()['total'] ?? 0);

        // Ambil semua developer untuk dropdown
        $developerId = $this->request->getGet('developer_id');
        $developers = $this->developerModel->findAll();

        // Builder properti dengan join ke developers
        $builder = $this->propertyModel
            ->select('properties.*, developers.name as developer_name, property_details.price_text, property_details.description')
            ->join('developers', 'developers.id = properties.developer_id', 'left')
            ->join('property_details', 'property_details.property_id = properties.id', 'left');

SELECT *
FROM `property_type`
WHERE `property_id` = '1'
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `properties`
SELECT COUNT(*) AS `numrows` FROM `developers`
---
        // Ambil types untuk tiap property
        $typeModel = new PropertyTypeModel();
        foreach ($properties as &$property) {
            $property['Types'] = $typeModel
                ->where('property_id', $property['id'])
                ->findAll();
        }
        unset($property); // clean reference

        $data = [
            'title'             => 'Dashboard',
            'breadcrumb'        => [['label' => 'Dashboard']],
            'username'          => $user['name'],
            'foto'              => $user['foto'],
            'totalProperty'     => $this->propertyModel->countAll(),
            'totalUser'         => $this->userModel->countAll(),
            'totalPenjualan'    => $jumlahPenjualan,
            'totalDeveloper'    => $this->developerModel->countAll(),
            'profileIncomplete' => $profileIncomplete,
            'user'              => $user,
            'developers'        => $developers,
            'developerId'       => $developerId,
            'properties'        => $properties,
            'pager'             => $pager,
        ];