app/Controllers/Dashboard/Property.php

    public function index()
    {
        $perPage = 5;

        // Join dengan developer untuk ambil nama developer
        $properties = $this->propertyModel
            ->select('properties.*, developers.name as developer_name')
            ->join('developers', 'developers.id = properties.developer_id')
            ->paginate($perPage);

        $pager = $this->propertyModel->pager;
        $imageModel = new PropertyImageModel();

        foreach ($properties as &$p) {
            $img = $imageModel->where('property_id', $p['id'])->first();
---
SELECT COUNT(*) AS `numrows`
FROM `properties`
JOIN `developers` ON `developers`.`id` = `properties`.`developer_id`
SELECT `properties`.*, `developers`.`name` as `developer_name`
FROM `properties`
JOIN `developers` ON `developers`.`id` = `properties`.`developer_id`
 LIMIT 5
SELECT *
FROM `property_images`
WHERE `property_id` = '1'
 LIMIT 1

    public function byDeveloper(string $slug)
    {
        $devModel  = model('App\Models\DeveloperModel');
        $developer = $devModel->where('slug', $slug)->first();
        if (! $developer) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Developer not found');
        }

        // ambil properti seperti biasa…
        $perPage    = 5;
        $builder    = $this->propertyModel
                           ->where('developer_id', $developer['id'])
                           ->orderBy('created_at','DESC');
        $properties = $builder->paginate($perPage);
        $pager      = $builder->pager;

        // assign thumbnail & images…
        $imageModel = new \App\Models\PropertyImageModel();
        foreach ($properties as &$p) {
            $imgs = $imageModel->where('property_id', $p['id'])->findAll();
---
SELECT *
FROM `properties`
WHERE `developer_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `developer_id` = '1'
SELECT *
FROM `property_images`
WHERE `property_id` = '1'

            }
        }

        return redirect()
            ->to(base_url('dashboard/property/developer/'.$slug))
            ->with('success', 'Property added.');
---
SELECT *
FROM `properties`
WHERE `slug` = 'centronia-residence'
AND `developer_id` = '1'
 LIMIT 1

    public function editByDeveloper(string $devSlug, string $propSlug)
    {
        $devModel   = model('App\Models\DeveloperModel');
        $developer  = $devModel->where('slug', $devSlug)->first();
        if (! $developer) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Developer not found');
        }

        // Cari property by slug & developer_id
        $property = $this->propertyModel
            ->where('slug', $propSlug)
            ->where('developer_id', $developer['id'])
            ->first();
        if (! $property) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Property not found');
        }

        // Ambil semua gambar untuk preview
        $imgModel = new \App\Models\PropertyImageModel();
        $imgs = $imgModel->where('property_id', $property['id'])->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `properties`
WHERE `slug` = 'centronia-residence'
AND `developer_id` = '1'
 LIMIT 1
SELECT *
FROM `property_images`
WHERE `property_id` = '1'
ORDER BY `sort_order` ASC

    public function updateByDeveloper(string $devSlug, string $propSlug)
    {
        helper('form');

        // Validasi input
        $rules = [
            'title'       => 'required|min_length[3]',
            'location'    => 'required',
            'price'       => 'required|numeric',
            'description' => 'required',
            'images'      => 'permit_empty'
                            .'|is_image[images.*]'
                            .'|max_size[images.*,2048]'
                            .'|max_files[images,10]',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('validation', $this->validator);
        }

        // Temukan developer & property
        $devModel  = model('App\Models\DeveloperModel');
        $developer = $devModel->where('slug', $devSlug)->first();
        $property  = $this->propertyModel
            ->where('slug', $propSlug)
            ->where('developer_id', $developer['id'])
            ->first();
---
SELECT *
FROM `properties`
WHERE `slug` = 'bhumi-svarga'
AND `developer_id` = '10'
 LIMIT 1