app/Controllers/Dashboard/Property.php

        }

        // Update data property (slug tidak berubah)
        $this->propertyModel->update($property['id'], $data);
---
UPDATE `properties` SET `title` = 'Bhumi Svarga', `price` = '800000000', `price_text` = '800 juta', `description` = 'OK'
WHERE `properties`.`id` IN ('2')