app/Controllers/Dashboard/Property.php

    public function byDeveloper(string $slug)
    {
        $devModel  = model(DeveloperModel::class);
        $developer = $devModel->where('slug', $slug)->first();
---
SELECT *
FROM `developers`
WHERE `slug` = 'sentul-city'
 LIMIT 1

    public function editByDeveloper(string $devSlug, string $propSlug)
    {
        $devModel   = model(DeveloperModel::class);
        $developer  = $devModel->where('slug', $devSlug)->first();
---
SELECT *
FROM `developers`
WHERE `slug` = 'sentul-city'
 LIMIT 1

    public function updateByDeveloper(string $devSlug, string $propSlug)
    {
        helper('form');

        // Validasi input text
        $rules = [
            'title'       => 'required|min_length[3]',
            'price'       => 'required|numeric',
            'price_text'  => 'required|string|max_length[100]',
            'description' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('validation', $this->validator);
        }

        // Cek developer
        $devModel  = model(DeveloperModel::class);
        $developer = $devModel->where('slug', $devSlug)->first();
---
SELECT *
FROM `developers`
WHERE `slug` = 'adhi-city'
 LIMIT 1