app/Controllers/Dashboard/SalesActivity.php

SELECT `absensi_sales`.*, `users`.`name`
FROM `absensi_sales`
JOIN `users` ON `users`.`id` = `absensi_sales`.`user_id`
ORDER BY `tanggal` DESC
SELECT *
FROM `absensi_sales`
WHERE `user_id` = '6'
ORDER BY `tanggal` DESC
SELECT *
FROM `absensi_sales`
WHERE `user_id` = '1'
AND `tanggal` = '2025-11-06'
 LIMIT 1
---
    public function absensi()
{
    $role = session('role');
    $userId = session('id');

    if ($role === 'admin') {
        $absensi = $this->absensiModel
            ->select('absensi_sales.*, users.name')
            ->join('users', 'users.id = absensi_sales.user_id')
            ->orderBy('tanggal', 'DESC')
            ->findAll();
    } else {
        $absensi = $this->absensiModel
            ->where('user_id', $userId)
            ->orderBy('tanggal', 'DESC')
            ->findAll();
    }

    $absenToday = $this->absensiModel
        ->where('user_id', $userId)
        ->where('tanggal', date('Y-m-d'))
        ->first();

SELECT *
FROM `properties`
SELECT `komisi_sales`.*, `bookings`.`id` AS `booking_code`, `bookings`.`buyer_name`, `bookings`.`unit_number`, `bookings`.`price`, `properties`.`title` AS `property_title`, `property_type`.`name` AS `type_name`
FROM `komisi_sales`
LEFT JOIN `bookings` ON `bookings`.`id` = `komisi_sales`.`booking_id`
LEFT JOIN `properties` ON `properties`.`id` = `bookings`.`property_id`
LEFT JOIN `property_type` ON `property_type`.`id` = `bookings`.`type_id`
WHERE `komisi_sales`.`user_id` = '6'
ORDER BY `komisi_sales`.`tanggal_pengajuan` DESC
---
public function komisi()
    {
        $propertyModel = new PropertyModel();
        $properties = $propertyModel->findAll();

        $userRole = session('role');
        $userId   = session('id');

        // 🔹 Data pengajuan komisi
        if ($userRole === 'admin') {
            $pengajuan = $this->komisiModel
                ->select("
                    komisi_sales.*,
                    users.name AS user_name,
                    bookings.id AS booking_code,
                    bookings.buyer_name,
                    bookings.unit_number,
                    bookings.price,
                    properties.title AS property_title,
                    property_type.name AS type_name
                ")
                ->join('users', 'users.id = komisi_sales.user_id')
                ->join('bookings', 'bookings.id = komisi_sales.booking_id', 'left')
                ->join('properties', 'properties.id = bookings.property_id', 'left')
                ->join('property_type', 'property_type.id = bookings.type_id', 'left')
                ->orderBy('komisi_sales.tanggal_pengajuan', 'DESC')
                ->findAll();
        } else {
            $pengajuan = $this->komisiModel
                ->select("
                    komisi_sales.*,
                    bookings.id AS booking_code,
                    bookings.buyer_name,
                    bookings.unit_number,
                    bookings.price,
                    properties.title AS property_title,
                    property_type.name AS type_name
                ")
                ->join('bookings', 'bookings.id = komisi_sales.booking_id', 'left')
                ->join('properties', 'properties.id = bookings.property_id', 'left')
                ->join('property_type', 'property_type.id = bookings.type_id', 'left')
                ->where('komisi_sales.user_id', $userId)
                ->orderBy('komisi_sales.tanggal_pengajuan', 'DESC')
                ->findAll();

SELECT `bookings`.*, `property_type`.`name` as `type_name`, `properties`.`title` as `property_title`
FROM `bookings`
LEFT JOIN `property_type` ON `property_type`.`id` = `bookings`.`type_id`
LEFT JOIN `properties` ON `properties`.`id` = `bookings`.`property_id`
WHERE `bookings`.`reserved_by_user_id` = '6'
AND `bookings`.`status` = 'confirmed'
AND `bookings`.`id` NOT IN (SELECT `booking_id` FROM `komisi_sales`)
ORDER BY `bookings`.`created_at` DESC
---
        $bookings = [];
        if ($userRole !== 'admin') {
            $bookingModel = new BookingModel();
            $bookings = $bookingModel
                ->select('bookings.*, property_type.name as type_name, properties.title as property_title')
                ->join('property_type', 'property_type.id = bookings.type_id', 'left')
                ->join('properties', 'properties.id = bookings.property_id', 'left')
                ->where('bookings.reserved_by_user_id', $userId)
                ->where('bookings.status', 'confirmed')
                ->whereNotIn('bookings.id', function ($builder) {
                    return $builder->select('booking_id')->from('komisi_sales');
                })
                ->orderBy('bookings.created_at', 'DESC')
                ->findAll();

SELECT *
FROM `settings`
 LIMIT 1
---
    public function cetakKomisiPreview($id)
    {
        helper('text');

        $komisi = $this->komisiModel
            ->select('komisi_sales.*, bookings.*, bookings.id as booking_code, users.name as sales_name, users.username as sales_username, property_type.name as type_name, properties.title as property_title')
            ->join('bookings', 'bookings.id = komisi_sales.booking_id')
            ->join('users', 'users.id = komisi_sales.user_id')
            ->join('properties', 'properties.id = bookings.property_id', 'left')
            ->join('property_type', 'property_type.id = bookings.type_id', 'left')
            ->where('komisi_sales.id', $id)
            ->first();

        if (!$komisi) {
            return redirect()->back()->with('error', 'Data pengajuan tidak ditemukan.');
        }

        $settingsModel = new SettingsModel();
        $settings = $settingsModel->first();