app/Controllers/Dashboard/Settings.php

    public function index()
    {
        $settingsModel      = $this->model;
        $settingsImageModel = new \App\Models\SettingsImageModel();

        $data = [
            'title'      => 'Settings',
            'breadcrumb' => [
                ['label' => 'Dashboard', 'url' => base_url('dashboard')],
                ['label' => 'Settings'],
            ],
            'settings' => $settingsModel->first(),
            'banners'  => $settingsImageModel
                ->whereIn('type', ['home', 'about', 'property', 'blog', 'contact']) // Ambil hanya banner-page
                ->orderBy('type', 'ASC') // gunakan 'type' bukan 'title'
                ->findAll(),
---
SELECT *
FROM `settings`
 LIMIT 1
SELECT *
FROM `settings_images`
WHERE `type` IN ('home','about','property','blog','contact')
ORDER BY `type` ASC