app/Controllers/Dashboard/User.php

    public function index()
    {
        $data = [
            'title'      => 'Manajemen User',
            'breadcrumb' => [['label' => 'Dashboard'], ['label' => 'User']],
            'users'      => $this->userModel->findAll(),
---
SELECT *
FROM `users`

    public function updateStatus($id)
    {
        if (session('role') !== 'admin') {
            return redirect()->back()->with('error', 'Akses ditolak');
        }

        $status = $this->request->getPost('is_active') == 1 ? 1 : 0;
        $this->userModel->update($id, ['is_active' => $status]);
---
UPDATE `users` SET `is_active` = 0, `updated_at` = '2025-08-01 19:30:32'
WHERE `users`.`id` IN ('7')