app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        // Load SettingsModel dan ambil 1 baris data settings
        $settingsModel = new \App\Models\SettingsModel();
        $settings = $settingsModel->first(); // karena hanya 1 baris
---
SELECT *
FROM `settings`
 LIMIT 1